ahtn/keyplus/ports/nrf52/src/ble_test.c
#define SEC_PARAM_BOND                      1                          /**< Perform bonding. */
#define SEC_PARAM_MITM                      0                          /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                      0                          /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS                  0                          /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES           BLE_GAP_IO_CAPS_NONE               /**< No I/O capabilities. */
#define SEC_PARAM_OOB                       0                          /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE              7                          /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE              16                         /**< Maximum encryption key size. */

#define OUTPUT_REPORT_MAX_LEN               1                          /**< Maximum length of Output Report. */
#define INPUT_REPORT_KEYS_INDEX             0                          /**< Index of Input Report. */
#define OUTPUT_REPORT_BIT_MASK_CAPS_LOCK    0x02                       /**< CAPS LOCK bit in Output Report (based on 'LED Page (0x08)' of the Universal Serial Bus HID Usage Tables). */
#define INPUT_REP_REF_ID                    0                          /**< Id of reference to Keyboard Input Report. */
#define OUTPUT_REP_REF_ID                   0                          /**< Id of reference to Keyboard Output Report. */

#define MAX_BUFFER_ENTRIES                  5                          /**< Number of elements that can be enqueued */

#define BASE_USB_HID_SPEC_VERSION           0x0101                     /**< Version number of base USB HID Specification implemented by this application. */

#define INPUT_REPORT_KEYS_MAX_LEN           8                          /**< Maximum length of the Input Report characteristic. */

#define DEAD_BEEF                           0xDEADBEEF                     /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SCHED_MAX_EVENT_DATA_SIZE           APP_TIMER_SCHED_EVENT_DATA_SIZE        /**< Maximum size of scheduler events. */
#ifdef SVCALL_AS_NORMAL_FUNCTION
#define SCHED_QUEUE_SIZE                    20                         /**< Maximum number of events in the scheduler queue. More is needed in case of Serialization. */
#else
#define SCHED_QUEUE_SIZE                    10                         /**< Maximum number of events in the scheduler queue. */
#endif

#define MODIFIER_KEY_POS                    0                          /**< Position of the modifier byte in the Input Report. */
#define SCAN_CODE_POS                       2                          /**< The start position of the key scan code in a HID Report. */
#define SHIFT_KEY_CODE                      0x02                       /**< Key code indicating the press of the Shift Key. */

#define MAX_KEYS_IN_ONE_REPORT              (INPUT_REPORT_KEYS_MAX_LEN - SCAN_CODE_POS)/**< Maximum number of key presses that can be sent in one Input Report. */


/** @} */

APP_TIMER_DEF(m_battery_timer_id);                  /**< Battery timer. */
BLE_HIDS_DEF(m_hids,                            /**< Structure used to identify the HID service. */
    NRF_SDH_BLE_TOTAL_LINK_COUNT,
    BLE_INPUT_REPORT_SIZE_BOOT_KB,
    BLE_INPUT_REPORT_SIZE_MOUSE,
    BLE_INPUT_REPORT_SIZE_SYSTEM,
    BLE_INPUT_REPORT_SIZE_CONSUMER,
    BLE_INPUT_REPORT_SIZE_NKRO,
    BLE_INPUT_REPORT_SIZE_VENDOR,
    BLE_OUTPUT_REPORT_SIZE_BOOT_KB,
    BLE_OUTPUT_REPORT_SIZE_VENDOR
    );
BLE_BAS_DEF(m_bas);                         /**< Structure used to identify the battery service. */
NRF_BLE_GATT_DEF(m_gatt);                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                         /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                 /**< Advertising module instance. */

static bool m_in_boot_mode = false;                 /**< Current protocol mode. */
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;        /**< Handle of the current connection. */
static sensorsim_cfg_t m_battery_sim_cfg;               /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;               /**< Battery Level sensor simulator state. */
static bool m_caps_on = false;                      /**< Variable to indicate if Caps Lock is turned on. */
static pm_peer_id_t m_peer_id;                      /**< Device reference handle to the current bonded central. */


/// Whether the device has connected yet
static bool m_conn_established;

/// Whether the device has established a secure connection yet
static bool m_conn_sec_established;

static ble_uuid_t m_adv_uuids[] =
{ {BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE} };

static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for setting filtered whitelist.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void whitelist_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
    uint32_t peer_id_count = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    ret_code_t err_code =
        pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d",
             peer_id_count + 1, BLE_GAP_WHITELIST_ADDR_MAX_COUNT);

    err_code = pm_whitelist_set(peer_ids, peer_id_count);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for setting filtered device identities.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void identities_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];
    uint32_t peer_id_count = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;

    ret_code_t err_code =
        pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);

    err_code = pm_device_identities_list_set(peer_ids, peer_id_count);
    APP_ERROR_CHECK(err_code);
}

/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

