ahtn/keyplus/ports/nrf52/src/ble_test.c
    dis_init_obj.dis_char_rd_sec = SEC_JUST_WORKS;

    err_code = ble_dis_init(&dis_init_obj);
    APP_ERROR_CHECK(err_code);
}

/// @brief Function for initializing Battery Service.
static void bas_init(void) {
    ret_code_t err_code;
    ble_bas_init_t bas_init_obj;

    memset(&bas_init_obj, 0, sizeof(bas_init_obj));

    bas_init_obj.evt_handler = NULL;
    bas_init_obj.support_notification = true;
    bas_init_obj.p_report_ref = NULL;
    bas_init_obj.initial_batt_level = 100;

    bas_init_obj.bl_rd_sec = SEC_JUST_WORKS;
    bas_init_obj.bl_cccd_wr_sec = SEC_JUST_WORKS;
    bas_init_obj.bl_report_rd_sec = SEC_JUST_WORKS;

    err_code = ble_bas_init(&m_bas, &bas_init_obj);
    APP_ERROR_CHECK(err_code);
}

#include "usb/util/usb_hid.h"
#include "usb/util/hut_keyboard.h"
#include "usb/util/hut_led.h"
#include "usb/util/hut_desktop.h"
#include "usb/util/hut_consumer.h"

static uint8_t report_map_data[] = {
    // Boot keyboard report: 0
    HID_USAGE_PAGE(1), HID_USAGE_PAGE_GENERIC_DESKTOP,
    HID_USAGE(1), HID_USAGE_KEYBOARD,
    HID_COLLECTION(1), HID_COLLECTION_APPLICATION,
    HID_REPORT_ID(1)       , BLE_REPORT_ID_BOOT_KB,
    // modifiers
    HID_USAGE_PAGE(1), HID_USAGE_PAGE_KEYBOARD,
    HID_USAGE_MINIMUM(1), KC_LEFT_CONTROL,
    HID_USAGE_MAXIMUM(1), KC_RIGHT_GUI,
    HID_LOGICAL_MINIMUM(1), 0x00,
    HID_LOGICAL_MAXIMUM(1), 0x01,
    HID_REPORT_COUNT(1), 0x08,
    HID_REPORT_SIZE(1), 0x01,
    HID_INPUT(1), IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
    // reserved/OEM
    HID_REPORT_COUNT(1), 0x01,
    HID_REPORT_SIZE(1), 0x08,
    HID_INPUT(1), IOF_CONSTANT | IOF_VARIABLE | IOF_ABSOLUTE,
    // keycodes
    HID_LOGICAL_MINIMUM(1), KC_NONE,
    HID_LOGICAL_MAXIMUM(1), KC_RIGHT_GUI,
    HID_USAGE_MINIMUM(1), KC_NONE,
    HID_USAGE_MAXIMUM(1), KC_RIGHT_GUI,
    HID_REPORT_COUNT(1), 0x06,
    // HID_REPORT_SIZE(1)     , 0x08, // Reuse global item
    HID_INPUT(1), IOF_DATA | IOF_ARRAY | IOF_ABSOLUTE,
    // LEDs
    HID_USAGE_PAGE(1), HID_USAGE_PAGE_LEDS,
    HID_LOGICAL_MINIMUM(1), 0x00,
    HID_LOGICAL_MAXIMUM(1), 0x01,
    HID_USAGE_MINIMUM(1), HID_LED_Num_Lock,
    HID_USAGE_MAXIMUM(1), HID_LED_Kana,
    HID_REPORT_COUNT(1), 0x05,
    HID_REPORT_SIZE(1), 0x01,
    HID_OUTPUT(1), IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
    // leftover
    HID_REPORT_COUNT(1), 0x01,
    HID_REPORT_SIZE(1), 0x03,
    HID_OUTPUT(1), IOF_CONSTANT | IOF_VARIABLE | IOF_ABSOLUTE,
    HID_END_COLLECTION(0),

#if 1
    //
    // Mouse report: 1
    //
    HID_USAGE_PAGE(1), HID_USAGE_PAGE_GENERIC_DESKTOP,
    HID_USAGE(1), HID_USAGE_MOUSE,
    HID_COLLECTION(1), HID_COLLECTION_APPLICATION,
    HID_REPORT_ID(1), BLE_REPORT_ID_MOUSE,
    // mouse
    HID_USAGE(1), HID_USAGE_POINTER,
    HID_COLLECTION(1), HID_COLLECTION_PHYSICAL,
    // mouse buttons
    HID_USAGE_PAGE(1), HID_USAGE_PAGE_BUTTON,
    HID_LOGICAL_MINIMUM(1), 0,
    HID_LOGICAL_MAXIMUM(1), 1,
    HID_USAGE_MINIMUM(1), 1,
    HID_USAGE_MAXIMUM(1), 16,
    HID_REPORT_COUNT(1), 16,
    HID_REPORT_SIZE(1), 1,
    HID_INPUT(1), IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
    // mouse X, Y
    HID_USAGE_PAGE(1), HID_USAGE_PAGE_GENERIC_DESKTOP,
    HID_USAGE(1), HID_USAGE_X,
    HID_USAGE(1), HID_USAGE_Y,
    HID_LOGICAL_MINIMUM(2), DB16(INT16_MIN),
    HID_LOGICAL_MAXIMUM(2), DB16(INT16_MAX),
    HID_REPORT_COUNT(1), 2,
    HID_REPORT_SIZE(1), 16,
    HID_INPUT(1), IOF_DATA | IOF_VARIABLE | IOF_RELATIVE,
    // mouse wheel
    HID_USAGE(1), HID_USAGE_WHEEL,
    HID_LOGICAL_MINIMUM(1), DB8(INT8_MIN),
    HID_LOGICAL_MAXIMUM(1), DB8(INT8_MAX),
    HID_REPORT_COUNT(1), 1,
    HID_REPORT_SIZE(1), 8,
    HID_INPUT(1), IOF_DATA | IOF_VARIABLE | IOF_RELATIVE,
    // mouse pan wheel
    HID_USAGE_PAGE(1), HID_USAGE_PAGE_CONSUMER,
    HID_USAGE(2), DB16(HID_CONSUMER_AC_PAN),
    // HID_LOGICAL_MINIMUM(1) , DB8(INT8_MIN), // Reuse global item
    // HID_LOGICAL_MAXIMUM(1) , DB8(INT8_MAX), // Reuse global item
    // HID_REPORT_COUNT(1)    , 1, // Reuse global item
    // HID_REPORT_SIZE(1)     , 8, // Reuse global item
    HID_INPUT(1), IOF_DATA | IOF_VARIABLE | IOF_RELATIVE,
    HID_END_COLLECTION(0),
    HID_END_COLLECTION(0),
#endif

#if 1
    //
    // System report
    //
    HID_USAGE_PAGE(1) , HID_USAGE_PAGE_GENERIC_DESKTOP, // Generic Desktop
    HID_USAGE(1)      , HID_USAGE_SYSTEM_CONTROL,
    HID_COLLECTION(1) , HID_COLLECTION_APPLICATION,
    HID_REPORT_ID(1)       , BLE_REPORT_ID_SYSTEM,
    // hid system code
    HID_LOGICAL_MINIMUM(1) , DB8(0x01),
    HID_LOGICAL_MAXIMUM(2) , DB16(HID_DESKTOP_System_Display_LCD_Autoscale),
    HID_USAGE_MINIMUM(1)   , DB8(0x01),
    HID_USAGE_MAXIMUM(2)   , DB16(HID_DESKTOP_System_Display_LCD_Autoscale),
    HID_REPORT_SIZE(1)     , 16,
    HID_REPORT_COUNT(1)    , 1,
    HID_INPUT(1)           , IOF_DATA | IOF_ARRAY | IOF_ABSOLUTE,
    HID_END_COLLECTION(0),
#endif

#if 1
    //
    // Consumer report
    //
    HID_USAGE_PAGE(1) , HID_USAGE_PAGE_CONSUMER,
    HID_USAGE(1)      , HID_CONSUMER_CONSUMER_CONTROL,
    HID_COLLECTION(1) , HID_COLLECTION_APPLICATION,
    HID_REPORT_ID(1)       , BLE_REPORT_ID_CONSUMER,
    // hid consumer code
    HID_LOGICAL_MINIMUM(1) , DB8(0x01),
    HID_LOGICAL_MAXIMUM(2) , DB16(HID_CONSUMER_AC_DISTRIBUTE_VERTICALLY),
    HID_USAGE_MINIMUM(1)   , DB8(0x01),
    HID_USAGE_MAXIMUM(2)   , DB16(HID_CONSUMER_AC_DISTRIBUTE_VERTICALLY),
    HID_REPORT_SIZE(1)     , 16,
    HID_REPORT_COUNT(1)    , 1,
    HID_INPUT(1)           , IOF_DATA | IOF_ARRAY | IOF_ABSOLUTE,
    HID_END_COLLECTION(0),
#endif

#if 1
    //
    // NKRO keyboard report
    //
    HID_USAGE_PAGE(1)        , HID_USAGE_PAGE_GENERIC_DESKTOP,
    HID_USAGE(1)             , HID_USAGE_KEYBOARD,
    HID_COLLECTION(1)        , HID_COLLECTION_APPLICATION,
    HID_REPORT_ID(1)       , BLE_REPORT_ID_NKRO,
    // keycode bitmap
    HID_USAGE_PAGE(1)      , HID_USAGE_PAGE_KEYBOARD,
    HID_USAGE_MINIMUM(1)   , KC_LEFT_CONTROL,
    HID_USAGE_MAXIMUM(1)   , KC_RIGHT_GUI,
    HID_LOGICAL_MINIMUM(1) , 0x00,
    HID_LOGICAL_MAXIMUM(1) , 0x01,
    HID_REPORT_COUNT(1)    , 0x08,
    HID_REPORT_SIZE(1)     , 0x01,
    HID_INPUT(1)           , IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
    // keycodes
    // HID_LOGICAL_MINIMUM(1) , 0x00, // Reuse global item
    // HID_LOGICAL_MAXIMUM(1) , 0x01, // Reuse global item
    HID_USAGE_MINIMUM(1)   , 0x00,
    HID_USAGE_MAXIMUM(1)   , 0xdf,
    HID_REPORT_COUNT(1)    , 0xe0,
    // HID_REPORT_SIZE(1)     , 0x01, // Reuse global item
    HID_INPUT(1)           , IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
    HID_END_COLLECTION(0),
#endif

#if 1
    HID_USAGE_PAGE(2), DB16(HID_USAGE_PAGE_VENDOR_START),
    HID_USAGE(1), HID_USAGE_VENDOR_0,
    HID_COLLECTION(1), HID_COLLECTION_VENDOR,
    HID_REPORT_ID(1)       , BLE_REPORT_ID_VENDOR,
    // Vendor input usage:
    HID_LOGICAL_MINIMUM(1) , DB8(0),
    HID_LOGICAL_MAXIMUM(2) , DB16(0x00ff),
    HID_REPORT_SIZE(1)     , 8,
    HID_REPORT_COUNT(1)    , VENDOR_REPORT_SIZE,
    HID_USAGE(1)           , HID_USAGE_VENDOR_1,
    HID_INPUT(1)           , IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
    // Vendor output usage:
    // HID_LOGICAL_MINIMUM(1) , DB8(0), // Reuse global item
    // HID_LOGICAL_MAXIMUM(2) , DB16(0x00FF), // Reuse global item
    // HID_REPORT_SIZE(1)     , 8, // Reuse global item
    // HID_REPORT_COUNT(1)    , 64, // Reuse global item
    HID_USAGE(1)           , HID_USAGE_VENDOR_2,
    HID_OUTPUT(1)          , IOF_DATA | IOF_VARIABLE | IOF_ABSOLUTE,
    HID_END_COLLECTION(0),
#endif

