ahtn/keyplus/ports/nrf52/src/ble_test.c
};


/**@brief Function for initializing HID Service.
*/
static void hids_init(void)
{
    ret_code_t err_code;
    ble_hids_init_t hids_init_obj;
    ble_hids_inp_rep_init_t *p_input_report;
    ble_hids_outp_rep_init_t *p_output_report;
    // ble_hids_feature_rep_init_t * p_feature_report;
    uint8_t hid_info_flags;

    static ble_hids_inp_rep_init_t input_report_array[BLE_INPUT_REPORT_COUNT];
    static ble_hids_outp_rep_init_t output_report_array[BLE_OUTPUT_REPORT_COUNT];
    static ble_hids_feature_rep_init_t feature_report_array[BLE_FEATURE_REP_COUNT];

    memset((void *)input_report_array, 0, sizeof(ble_hids_inp_rep_init_t));
    memset((void *)output_report_array, 0,
        sizeof(ble_hids_outp_rep_init_t));
    memset((void *)feature_report_array, 0,
        sizeof(ble_hids_feature_rep_init_t));

    //
    // Input reports
    //

    // HID Boot keyboard
    p_input_report = &input_report_array[BLE_INPUT_REPORT_INDEX_BOOT_KB];
    p_input_report->max_len = BLE_INPUT_REPORT_SIZE_BOOT_KB;
    p_input_report->rep_ref.report_id = BLE_REPORT_ID_BOOT_KB;
    p_input_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_INPUT;

    p_input_report->sec.cccd_wr = SEC_JUST_WORKS;
    p_input_report->sec.wr = SEC_JUST_WORKS;
    p_input_report->sec.rd = SEC_JUST_WORKS;

#if 1
    // HID Mouse
    p_input_report = &input_report_array[BLE_INPUT_REPORT_INDEX_MOUSE];
    p_input_report->max_len = BLE_INPUT_REPORT_SIZE_MOUSE;
    p_input_report->rep_ref.report_id = BLE_REPORT_ID_MOUSE;
    p_input_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_INPUT;

    p_input_report->sec.cccd_wr = SEC_JUST_WORKS;
    p_input_report->sec.wr = SEC_JUST_WORKS;
    p_input_report->sec.rd = SEC_JUST_WORKS;
#endif

#if 1
    // HID System
    p_input_report = &input_report_array[BLE_INPUT_REPORT_INDEX_SYSTEM];
    p_input_report->max_len = BLE_INPUT_REPORT_SIZE_SYSTEM;
    p_input_report->rep_ref.report_id = BLE_REPORT_ID_SYSTEM;
    p_input_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_INPUT;

    p_input_report->sec.cccd_wr = SEC_JUST_WORKS;
    p_input_report->sec.wr = SEC_JUST_WORKS;
    p_input_report->sec.rd = SEC_JUST_WORKS;
#endif

#if 1
    // HID Consumer
    p_input_report = &input_report_array[BLE_INPUT_REPORT_INDEX_CONSUMER];
    p_input_report->max_len = BLE_INPUT_REPORT_SIZE_CONSUMER;
    p_input_report->rep_ref.report_id = BLE_REPORT_ID_CONSUMER;
    p_input_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_INPUT;

    p_input_report->sec.cccd_wr = SEC_JUST_WORKS;
    p_input_report->sec.wr = SEC_JUST_WORKS;
    p_input_report->sec.rd = SEC_JUST_WORKS;
#endif

#if 1
    // HID NKRO keyboard
    p_input_report = &input_report_array[BLE_INPUT_REPORT_INDEX_NKRO];
    p_input_report->max_len = BLE_INPUT_REPORT_SIZE_NKRO;
    p_input_report->rep_ref.report_id = BLE_REPORT_ID_NKRO;
    p_input_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_INPUT;

    p_input_report->sec.cccd_wr = SEC_JUST_WORKS;
    p_input_report->sec.wr = SEC_JUST_WORKS;
    p_input_report->sec.rd = SEC_JUST_WORKS;
#endif

#if 1
    // HID Vendor
    p_input_report = &input_report_array[BLE_INPUT_REPORT_INDEX_VENDOR];
    p_input_report->max_len = BLE_INPUT_REPORT_SIZE_VENDOR;
    p_input_report->rep_ref.report_id = BLE_REPORT_ID_VENDOR;
    p_input_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_INPUT;

    p_input_report->sec.cccd_wr = SEC_JUST_WORKS;
    p_input_report->sec.wr = SEC_JUST_WORKS;
    p_input_report->sec.rd = SEC_JUST_WORKS;
#endif

    //
    // Output reports
    //

    // Boot keyboard output report (capslock led, etc)
    p_output_report = &output_report_array[BLE_OUTPUT_REPORT_INDEX_BOOT_KB];
    p_output_report->max_len = BLE_OUTPUT_REPORT_SIZE_BOOT_KB;
    p_output_report->rep_ref.report_id = OUTPUT_REP_REF_ID;
    p_output_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_OUTPUT;

    p_output_report->sec.wr = SEC_JUST_WORKS;
    p_output_report->sec.rd = SEC_JUST_WORKS;

#if 1
    p_output_report = &output_report_array[BLE_OUTPUT_REPORT_INDEX_VENDOR];
    p_output_report->max_len = BLE_OUTPUT_REPORT_SIZE_VENDOR;
    p_output_report->rep_ref.report_id = BLE_REPORT_ID_VENDOR;
    p_output_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_OUTPUT;

    p_output_report->sec.wr = SEC_JUST_WORKS;
    p_output_report->sec.rd = SEC_JUST_WORKS;
#endif

    //
    // Feature reports
    //
#if 0
    p_feature_report                      = &feature_report_array[FEATURE_REPORT_INDEX];
    p_feature_report->max_len             = FEATURE_REPORT_MAX_LEN;
    p_feature_report->rep_ref.report_id   = FEATURE_REP_REF_ID;
    p_feature_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_FEATURE;

    p_feature_report->sec.rd              = SEC_JUST_WORKS;
    p_feature_report->sec.wr              = SEC_JUST_WORKS;
#endif

    hid_info_flags = HID_INFO_FLAG_REMOTE_WAKE_MSK |
                     HID_INFO_FLAG_NORMALLY_CONNECTABLE_MSK;
    memset(&hids_init_obj, 0, sizeof(hids_init_obj));

    hids_init_obj.evt_handler = on_hids_evt;
    hids_init_obj.error_handler = service_error_handler;
    hids_init_obj.is_kb = true;
    hids_init_obj.is_mouse = false;
    hids_init_obj.inp_rep_count = BLE_INPUT_REPORT_COUNT;
    hids_init_obj.p_inp_rep_array = input_report_array;
    hids_init_obj.outp_rep_count = BLE_OUTPUT_REPORT_COUNT;
    hids_init_obj.p_outp_rep_array = output_report_array;
    hids_init_obj.feature_rep_count = BLE_FEATURE_REP_COUNT;
    hids_init_obj.p_feature_rep_array = feature_report_array;
    hids_init_obj.rep_map.data_len = sizeof(report_map_data);
    hids_init_obj.rep_map.p_data = report_map_data;
    hids_init_obj.hid_information.bcd_hid = BASE_USB_HID_SPEC_VERSION;
    hids_init_obj.hid_information.b_country_code = 0;
    hids_init_obj.hid_information.flags = hid_info_flags;
    hids_init_obj.included_services_count = 0;
    hids_init_obj.p_included_services_array = NULL;

    hids_init_obj.rep_map.rd_sec = SEC_JUST_WORKS;
    hids_init_obj.hid_information.rd_sec = SEC_JUST_WORKS;

    hids_init_obj.boot_kb_inp_rep_sec.cccd_wr = SEC_JUST_WORKS;
    hids_init_obj.boot_kb_inp_rep_sec.rd = SEC_JUST_WORKS;

    hids_init_obj.boot_kb_outp_rep_sec.rd = SEC_JUST_WORKS;
    hids_init_obj.boot_kb_outp_rep_sec.wr = SEC_JUST_WORKS;

    hids_init_obj.protocol_mode_rd_sec = SEC_JUST_WORKS;
    hids_init_obj.protocol_mode_wr_sec = SEC_JUST_WORKS;
    hids_init_obj.ctrl_point_wr_sec = SEC_JUST_WORKS;

    err_code = ble_hids_init(&m_hids, &hids_init_obj);
    APP_ERROR_CHECK(err_code);
}

/// @brief Function for initializing services that will be used by the application.
static void services_init(void) {
    qwr_init();
    dis_init();
    bas_init();
    hids_init();
}

/**@brief Function for initializing the battery sensor simulator.
*/
static void sensor_simulator_init(void) {
    m_battery_sim_cfg.min = MIN_BATTERY_LEVEL;
    m_battery_sim_cfg.max = MAX_BATTERY_LEVEL;
    m_battery_sim_cfg.incr = BATTERY_LEVEL_INCREMENT;
    m_battery_sim_cfg.start_at_max = true;

    sensorsim_init(&m_battery_sim_state, &m_battery_sim_cfg);
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error) {
    APP_ERROR_HANDLER(nrf_error);
}

/// @brief Function for handling a Connection Parameters event
void conn_params_handler(ble_conn_params_evt_t * p_evt) {
    switch (p_evt->evt_type) {
        case BLE_CONN_PARAMS_EVT_SUCCEEDED: {
            NRF_LOG_INFO("BLE conn parameters succeeded");
            m_conn_established = true;
        } break;
        case BLE_CONN_PARAMS_EVT_FAILED: {
            NRF_LOG_INFO("BLE conn parameters failed");
            m_conn_established = false;
        } break;
    }
}

/// @brief Function for initializing the Connection Parameters module.
static void conn_params_init(void) {
    ret_code_t err_code;
    ble_conn_params_init_t cp_init;

    m_conn_established = false;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail = false;
    cp_init.evt_handler = conn_params_handler;
    cp_init.error_handler = conn_params_error_handler;

