ahtn/keyplus/ports/nrf52/src/ble_test.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

/// @brief Function for starting timers.
static void timers_start(void) {
    ret_code_t err_code;

    err_code = app_timer_start(m_battery_timer_id,
                               BATTERY_LEVEL_MEAS_INTERVAL,
                               NULL);
    APP_ERROR_CHECK(err_code);
}

void kp_ble_hids_input_report_send(
    uint8_t report_index,
    uint8_t report_size,
    uint8_t* data
) {
    uint32_t err_code;

    assert(report_index < BLE_INPUT_REPORT_COUNT);

    err_code = ble_hids_inp_rep_send(&m_hids,
        report_index,
        report_size,
        data,
        m_conn_handle);

    if (err_code != NRF_SUCCESS) {
        NRF_LOG_INFO("sending: {index: %d, size: %d, err_code: %s}",
            report_index, report_size, nrf_strerror_get(err_code));
    }

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       ) {
        APP_ERROR_HANDLER(err_code);
    }
}

uint8_t m_output_ready[BLE_OUTPUT_REPORT_COUNT];

bool kp_ble_hids_output_has_data(uint8_t report_index) {
    return m_output_ready[report_index];
}

void kp_ble_hids_output_report_read(
    uint8_t report_index,
    uint8_t report_size,
    uint8_t *dest
) {
    uint32_t err_code;
    err_code = ble_hids_outp_rep_get(&m_hids,
        report_index,
        report_size,
        0,
        m_conn_handle,
        dest);
    APP_ERROR_CHECK(err_code);
    m_output_ready[report_index] = 0;
}


void send_vendor(uint32_t code) {
    ret_code_t err_code;

    uint8_t data[64] = {
        0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b,
        0x0c, 0x0d, 0x0e, 0x0f, 0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17,
        0x18, 0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x1e, 0x1f, 0x20, 0x21, 0x22, 0x23,
        0x24, 0x25, 0x26, 0x27, 0x28, 0x29, 0x2a, 0x2b, 0x2c, 0x2d, 0x2e, 0x2f,
        0x30, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38, 0x39, 0x3a, 0x3b,
        0x3c, 0x3d, 0x3e, 0x3f,
    };

    // ((uint32_t*)data)[0] = code;

    err_code = ble_hids_inp_rep_send(&m_hids,
        BLE_INPUT_REPORT_INDEX_VENDOR,
        BLE_INPUT_REPORT_SIZE_VENDOR,
        (uint8_t*)data,
        m_conn_handle);

    NRF_LOG_INFO("sending: {index: %d, size: %d, err_code: %s}",
        BLE_INPUT_REPORT_INDEX_VENDOR,
        BLE_INPUT_REPORT_SIZE_VENDOR,
        nrf_strerror_get(err_code));

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       ) {
        APP_ERROR_HANDLER(err_code);
    }
}

/// @brief Function for putting the chip into sleep mode.
///
/// @note This function will not return.
static void sleep_mode_enter(void) {
    ret_code_t err_code;

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling HID events.
 *
 * @details This function will be called for all HID events which are passed to the application.
 *
 * @param[in]   p_hids  HID service structure.
 * @param[in]   p_evt   Event received from the HID service.
 */
static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt) {
    switch (p_evt->evt_type) {
        case BLE_HIDS_EVT_BOOT_MODE_ENTERED:
            m_in_boot_mode = true;
            break;

        case BLE_HIDS_EVT_REPORT_MODE_ENTERED:
            m_in_boot_mode = false;
            break;

        case BLE_HIDS_EVT_REP_CHAR_WRITE:
            // on_hid_rep_char_write(p_evt);
            break;

        case BLE_HIDS_EVT_NOTIF_ENABLED:
            break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt) {
    ret_code_t err_code;

    switch (ble_adv_evt) {
        case BLE_ADV_EVT_DIRECTED_HIGH_DUTY:
            NRF_LOG_INFO("High Duty Directed advertising.");
            err_code =
                bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_DIRECTED:
            NRF_LOG_INFO("Directed advertising.");
            err_code =
                bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_FAST:
            NRF_LOG_INFO("Fast advertising.");
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_SLOW:
            NRF_LOG_INFO("Slow advertising.");
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_SLOW);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_FAST_WHITELIST:
            NRF_LOG_INFO("Fast advertising with whitelist.");
            err_code =
                bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_SLOW_WHITELIST:
            NRF_LOG_INFO("Slow advertising with whitelist.");
            err_code =
                bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_ADV_EVT_IDLE:
            sleep_mode_enter();
            break;

