ahtn/keyplus/ports/nrf52/src/ble_test.c
    memset(&init, 0, sizeof(init));

    adv_flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.name_type = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = true;
    init.advdata.flags = adv_flags;
    init.advdata.uuids_complete.uuid_cnt =
        sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids = m_adv_uuids;

    init.config.ble_adv_whitelist_enabled = true;
    init.config.ble_adv_directed_high_duty_enabled = true;
    init.config.ble_adv_directed_enabled = false;
    init.config.ble_adv_directed_interval = 0;
    init.config.ble_adv_directed_timeout = 0;
    init.config.ble_adv_fast_enabled = true;
    init.config.ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
    init.config.ble_adv_fast_timeout = APP_ADV_FAST_DURATION;
    init.config.ble_adv_slow_enabled = true;
    init.config.ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
    init.config.ble_adv_slow_timeout = APP_ADV_SLOW_DURATION;

    init.evt_handler = on_adv_evt;
    init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/// @brief Function for initializing the nrf log module.
static void log_init(void) {
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/// @brief Function for initializing power management.
static void power_management_init(void) {
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void) {
    app_sched_execute();
    if (NRF_LOG_PROCESS() == false) {
        nrf_pwr_mgmt_run();
    }
}

/// @brief Handler for receiving ESB data during a timeslot
static void timeslot_data_handler(void * p_data, uint16_t length) {
    // p_data, do something
}

static void esb_multiprotocol_start(void) {
    uint32_t err_code;

    err_code = esb_timeslot_init(timeslot_data_handler);
    APP_ERROR_CHECK(err_code);

    err_code = esb_timeslot_start();
    APP_ERROR_CHECK(err_code);
}

#include "core/aes.h"
#include "core/error.h"
#include "core/hardware.h"
#include "core/led.h"
#include "core/matrix_interpret.h"
#include "core/matrix_scanner.h"
#include "core/settings.h"
#include "core/usb_commands.h"
#include "core/timer.h"
#include "core/macro.h"
#include "core/rf.h"
#include "core/unifying.h"

#include "key_handlers/key_mouse.h"
#include "key_handlers/key_hold.h"

/// @brief Function for application main entry.
int ble_test_main(uint8_t x) {
    bool erase_bonds = false;

    // Initialize.
    log_init();

    // keyplus init
    {
        timer_init();
        io_map_init();
        hardware_init();
        init_error_system();
        led_init();

        NRF_LOG_INFO("loading settings from flash");
        settings_load_from_flash();
        aes_key_init(g_rf_settings.ekey, g_rf_settings.dkey);
        keyboards_init();
        matrix_scanner_init();

        g_runtime_settings.mode = TRANS_MODE_BLE;
        g_rf_settings.hw_type = RF_HW_BLE_AND_ESB;
        g_rf_enabled = true;
        rf_init_receive();

        reset_hid_reports();
        // reset_usb_reports();

        if (has_critical_error()) {
            NRF_LOG_HEXDUMP_INFO(g_error_code_table, SIZE_ERROR_CODE_TABLE);
            // recovery_mode_main_loop();
            APP_ERROR_HANDLER(0xffff);
        }
    }
    {
        uint16_t sid = 0xFFFF;
        sid = load_session_id();
        NRF_LOG_INFO("sid: %d", sid);
    }

    timers_init();
    power_management_init();
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("BLE HID Keyboard example started.");
    timers_start();
    advertising_start(erase_bonds);

    esb_multiprotocol_start();

    uint32_t last_time = 0;

    // Enter main loop.
    for (;;) {
        led_testing_toggle(1);
        led_testing_set(0, 0);

        // Log current time (for debugging)
        {
            uint32_t new_time = timer_read_ms();
            if ((uint32_t)(new_time - last_time) >= 1000) {
                uint32_t time_sec = new_time/1000;
                last_time = new_time;

                NRF_LOG_INFO("time: %d", new_time);

                if (time_sec % 5 == 0) {
                    struct timeslot_stats_t stats = get_timeslot_stats();
                    NRF_LOG_INFO(
                        "timeslot stats: {start: %04d, end: %04d, "
                        "tx: %04d, rx: %04d, ext: %04d}",
                        stats.start, stats.end,
                        stats.tx, stats.rx,
                        stats.extensions
                        );
                    NRF_LOG_INFO(
                        "conn stats: {handle: %d, established: %d, sec: %d}",
                        m_conn_handle, m_conn_established, m_conn_sec_established
                        );
                }

#if 0
                if (m_conn_handle != BLE_CONN_HANDLE_INVALID
                    && m_conn_sec_established && m_conn_established) {
                    send_vendor(0x12345678UL);
                }
#endif
            }
        }

        led_testing_toggle(0);

        // Matrix scanning
        {
            bool scan_changed = false;

            scan_changed |= matrix_scan();
            if (scan_changed) {
                uint8_t matrix_data[32];
                const uint8_t use_deltas = true;
                const uint8_t data_size = get_matrix_data(matrix_data, use_deltas);
                UNUSED_PARAMETER(data_size);

                NRF_LOG_INFO("button pressed");

                keyboard_update_device_matrix(GET_SETTING(device_id), matrix_data);
            }

            interpret_all_keyboard_matrices();
        }

        led_testing_toggle(0);

#if USE_NRF24
        if (g_rf_enabled) {
#if USE_UNIFYING
            if (unifying_is_pairing_active()) {
                unifying_pairing_poll();
            } else {
                rf_task();
            }
            unifying_mouse_handle();
#else
            rf_task();
#endif
        }
#endif

        led_testing_toggle(0);

        macro_task();
        mouse_key_task();

        if (m_conn_handle != BLE_CONN_HANDLE_INVALID
            && m_conn_sec_established && m_conn_established) {
            send_hid_reports();
        }

        led_testing_toggle(0);

        sticky_key_task();
        hold_key_task(false);

        led_testing_toggle(0);

        idle_state_handle();
    }
}

/**
 * @}
 */
